Revit 2027 API
BuiltInFailures.CreationFailures.CannotDrawWalls Property
 Can't make Wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotDrawWalls { get; }
Public Shared ReadOnly Property CannotDrawWalls As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotDrawWalls {
	FailureDefinitionId^ get ();
}
static member CannotDrawWalls : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace